tutorials/oodles/pitzDailyDirectMapped/system/changeDictionaryDict
FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/warhol/chris/foam/chris2.1/run/tutorials/interFoam";
    case            "damBreak";
    instance        "system";
    local           "";

    class           dictionary;
    object          changePatchTypeDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dictionaryReplacement
{
    // boundary handled explicitly since not dictionary.
    boundary
    {
        inlet
        {
            type            directMappedPatch;
            offset          (0.05 0 0);
        }
    }
}

// ************************************************************************* //
